/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_fflush.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sgaladri <sgaladri@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/24 00:41:39 by sgaladri          #+#    #+#             */
/*   Updated: 2021/11/24 00:46:43 by sgaladri         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>  // Для printf, fflush
#include <unistd.h>  // Для sleep

int main (void)
{  
   int i = 0; // Счетчик секунд
  
   // Бесконечный цикл
   while (i <= 5)
   {    
      // Вывод строки (строка записывается в буфер)
      printf ("\r%d\n", i);
      //Сброс буфера (строка отобразится в консоле)
      fflush (stdout);
      //Задержка на 1 секунду
      sleep (1);
      //Увеличение счетчика секунд на 1
      i++;
   }
   return 0;
} 